Documents/ESB/ESB_Consumer_0608/003TestSample/SAMPLE_XML_MUST/DebitCard/DC01_DbCardTxnDtlsInqRq.xml

<?xml version="1.0" encoding="utf-8"?>

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:v1="http://www.iisigroup.com/magiclamp/common/soapenv.xsd/v1" xmlns:v11="http://www.nextbank.com.tw/xsd/TW/DebitCard/DbCardTxnDtlsInqRq/v1">  
  <soap:Header> 
    <v1:Header v1:mustUnderstand="true"> 
      <ChannelID>ESB</ChannelID>  
      <ServiceDomain>DebitCard</ServiceDomain>  
      <OperationName>DbCardTxnDtlsInq</OperationName>  
      <ConsumerID>TWESB</ConsumerID>  
      <TransactionID>T1222222</TransactionID>  
      <RqTimestamp>2015-12-06T12:01:01.00+08:00</RqTimestamp> 
    </v1:Header> 
  </soap:Header>  
  <soap:Body> 
    <v11:DbCardTxnDtlsInqRq> 
      <v11:ServiceHeader> 
        <v11:TxnId>DC01</v11:TxnId>  
        <v11:TxnNo>DC0100001</v11:TxnNo> 
      </v11:ServiceHeader>  
      <v11:Signon> 
        <v11:CustId>ESBUSER</v11:CustId> 
      </v11:Signon>  
      <v11:ServiceBody> 
        <v11:PageNo>1</v11:PageNo>  
        <v11:NoOfPage>10</v11:NoOfPage>  
        <v11:InqType>3</v11:InqType>  
        <v11:InqKeyId>T320916197</v11:InqKeyId>  
        <v11:StartTxnDate>20160501</v11:StartTxnDate>  
        <v11:EndTxnDate>20160530</v11:EndTxnDate> 
      </v11:ServiceBody> 
    </v11:DbCardTxnDtlsInqRq> 
  </soap:Body> 
</soap:Envelope>
